NextFOAM-2606/tutorials/incompressible/pimpleFoam/laminar/cylinder2D/system/DMDs/stdmd04
// -*- C++ -*-

stdmd04
{
    ${stdmd01}

    patch          outlet;
}


// ************************************************************************* //
