NextFOAM-2606/tutorials/incompressible/pimpleFoam/laminar/cylinder2D/system/DMDs/stdmd36
// -*- C++ -*-

stdmd36
{
    ${stdmd01}

    field           pMean;
}


// ************************************************************************* //
