NextFOAM-2606/tutorials/incompressible/pimpleFoam/laminar/cylinder2D/system/DMDs/stdmd51
// -*- C++ -*-

stdmd51
{
    ${stdmd01}

    field          fieldAverage2:UMean_movingAverageWindow;
    region         coarseMesh;
}


// ************************************************************************* //
