NextFOAM-2606/tutorials/incompressible/pimpleFoam/laminar/cylinder2D/system/DMDs/stdmd60
// -*- C++ -*-

stdmd60
{
    ${stdmd01}

    field          yPlus;
    maxRank        10;
}


// ************************************************************************* //
